In [2]:
pip install pandas

Collecting pandas
  Downloading pandas-2.1.2-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.3 MB)
     |████████████████████████████████| 12.3 MB 3.5 MB/s eta 0:00:01
Requirement already satisfied: pytz>=2020.1 in ./miniconda3/lib/python3.9/site-packages (from pandas) (2022.7)
Collecting tzdata>=2022.1
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
     |████████████████████████████████| 341 kB 70.7 MB/s eta 0:00:01
Requirement already satisfied: numpy<2,>=1.22.4 in ./miniconda3/lib/python3.9/site-packages (from pandas) (1.26.0)
Requirement already satisfied: python-dateutil>=2.8.2 in ./miniconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in ./miniconda3/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: tzdata, pandas
Successfully installed pandas-2.1.2 tzdata-2023.3
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [12]:
print(pd.__version__)

2.1.2

In [6]:
#1. Write a python program to implement List-to-Series Conversion

input_string = input("Enter a list element separated by space ")

list1  = input_string.split()

series = pd.Series(list1) #list to series

print(series)

Enter a list element separated by space 55 22 66 77
0    55
1    22
2    66
3    77
dtype: object

In [15]:
#2. Write a python program to Generate the series of dates from 1st May, 2021 to 12th May, 2021 (both inclusive).
date_series = pd.date_range(start ='5-1-2021', end ='5-12-2021') 
  
for dates in date_series: 
    print(dates)

2021-05-01 00:00:00
2021-05-02 00:00:00
2021-05-03 00:00:00
2021-05-04 00:00:00
2021-05-05 00:00:00
2021-05-06 00:00:00
2021-05-07 00:00:00
2021-05-08 00:00:00
2021-05-09 00:00:00
2021-05-10 00:00:00
2021-05-11 00:00:00
2021-05-12 00:00:00

In [13]:
#3. Given a dictionary, convert it into corresponding dataframe and display it.
data = {"Year": [2017, 2018, 2019, 2020, 2021, 2022, 2023],
        "Sales": [150, 175, 183, 72, 126, 168, 144] }

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)

   Year  Sales
0  2017    150
1  2018    175
2  2019    183
3  2020     72
4  2021    126
5  2022    168
6  2023    144

In [18]:
#4. Given a 2D List, convert it into corresponding dataframe and display it.
  
data = [[2017, 150],[2018, 175],[2019, 183],
        [2020, 72],[2021, 126],[2022, 168],[2023, 144]]  
  
# creating df object with columns specified     
df = pd.DataFrame(data, columns =['Year', 'Sales'])  
print(df)

   Year  Sales
0  2017    150
1  2018    175
2  2019    183
3  2020     72
4  2021    126
5  2022    168
6  2023    144

In [22]:
#5. Given a CSV file, read it into a dataframe and display it.
df = pd.read_csv('data.csv')

print(df.to_string())

          Country  Capital City
0           India     New Delhi
1       Sri Lanka       Colombo
2          Canada        Ottawa
3  United Kingdom        London
4           Egypt         Cairo
5       Argentina  Buenos Aires

In [59]:
#6. Given a dataframe, sort it by multiple columns

df = pd.DataFrame({'Team/NOC': ['Thailand (THA)','India (IND)','Chinese Taipei (TPE)','Peoples Republic of China (CHN)','Bahrain (BRN)','Republic of Korea (KOR)',
                               'Iran (IRI)','D.P.R. Korea (PRK)','Uzbekistan (UZB)','Japan (JPN)'],
                   'Gold': [12, 28, 19, 201, 12, 48, 13, 11, 22, 52],
                   'Silver': [14, 38, 20, 111,3 ,59, 21, 18, 18, 67],
                  'Bronze':[32, 41, 28, 71, 5,89,20,10, 31, 69]})
 
# printing the dataframe
print('Asian Games 2023: Final medal table - Top 10 Countries')

df.sort_values(by = ['Gold', 'Silver'], ascending = [False, False])

Asian Games 2023: Final medal table - Top 10 Countries

                          Team/NOC  Gold  Silver  Bronze
3  Peoples Republic of China (CHN)   201     111      71
9                      Japan (JPN)    52      67      69
5          Republic of Korea (KOR)    48      59      89
1                      India (IND)    28      38      41
8                 Uzbekistan (UZB)    22      18      31
2             Chinese Taipei (TPE)    19      20      28
6                       Iran (IRI)    13      21      20
0                   Thailand (THA)    12      14      32
4                    Bahrain (BRN)    12       3       5
7               D.P.R. Korea (PRK)    11      18      10

In [64]:
#7. Given a dataframe with custom indexing, convert and it to default indexing and display it.


df.set_index("Team/NOC", inplace = True)
print(df,'\n') 
df.reset_index("Team/NOC", inplace = True)

print(df)

                                 Gold  Silver  Bronze
Team/NOC
Thailand (THA)                     12      14      32
India (IND)                        28      38      41
Chinese Taipei (TPE)               19      20      28
Peoples Republic of China (CHN)   201     111      71
Bahrain (BRN)                      12       3       5
Republic of Korea (KOR)            48      59      89
Iran (IRI)                         13      21      20
D.P.R. Korea (PRK)                 11      18      10
Uzbekistan (UZB)                   22      18      31
Japan (JPN)                        52      67      69

                          Team/NOC  Gold  Silver  Bronze
0                   Thailand (THA)    12      14      32
1                      India (IND)    28      38      41
2             Chinese Taipei (TPE)    19      20      28
3  Peoples Republic of China (CHN)   201     111      71
4                    Bahrain (BRN)    12       3       5
5          Republic of Korea (KOR)    48      59      89
6                       Iran (IRI)    13      21      20
7               D.P.R. Korea (PRK)    11      18      10
8                 Uzbekistan (UZB)    22      18      31
9                      Japan (JPN)    52      67      69

In [65]:
#8. Given a dataframe, select first 2 rows and output them.

df.head(2)

         Team/NOC  Gold  Silver  Bronze
0  Thailand (THA)    12      14      32
1     India (IND)    28      38      41

In [70]:
#9. Given is a dataframe showing name, occupation, salary of people. Find the average salary per occupation.

df = pd.DataFrame({'Name': ['Bob','Alice','Robert','Henry','Graham','Patrick','Paul'],
                  'Occupation': ['Teacher','Doctor','Driver','Teacher','Doctor','Driver','Teacher'],
                  'Salary': [35000,63000,13000,32000,65000,15000,33000]})
print(df) 

df.groupby('Occupation')['Salary'].mean()

      Name Occupation  Salary
0      Bob    Teacher   35000
1    Alice     Doctor   63000
2   Robert     Driver   13000
3    Henry    Teacher   32000
4   Graham     Doctor   65000
5  Patrick     Driver   15000
6     Paul    Teacher   33000

Occupation
Doctor     64000.000000
Driver     14000.000000
Teacher    33333.333333
Name: Salary, dtype: float64

In [73]:
#10. Given a dataframe with NaN Values, fill the NaN values with 0.

import numpy as np

df = pd.DataFrame({'Numbers':[55,49,32,np.nan,67,11,np.nan]})

df.fillna(0)

   Numbers
0     55.0
1     49.0
2     32.0
3      0.0
4     67.0
5     11.0
6      0.0

In [79]:
#11. Given is a dataframe showing Company Names (cname) and corresponding Profits
# (profit). Convert the values of Profit column such that values in it greater than 0 are
# set to True and the rest are set to False.

df = pd.DataFrame({'cname':['Stark Industries','Fregata Industries','Bromley Sports', 'Marco Donateli'],
                  'profit':[1500000,-2400000,6540000,-502000]})
df["profit"] = df["profit"] > 0

print(df)

                cname  profit
0    Stark Industries    True
1  Fregata Industries   False
2      Bromley Sports    True
3      Marco Donateli   False

In [81]:
#12. Given are 2 dataframes, with one dataframe containing Employee ID (eid), Employee
# Name (ename) and Stipend (stipend) and the other dataframe containing Employee ID
# (eid) and designation of the employee (designation). Output the Dataframe containing
# Employee ID (eid), Employee Name (ename), Stipend (stipend) and Position
# (position).

df1 = pd.DataFrame({'eid':[11,12,13,14,15,16,17],
                   'ename':['Bob','Alice','Robert','Henry','Graham','Patrick','Paul'],
                   'stipend':[10000,10000,5000,15000,5000,10000,10000]})

df2 = pd.DataFrame({'eid':[11,12,13,14,15,16,17],
                   'designation':["Employee","Employee","Intern","Senior Employee","Intern","Employee","Employee"]})

dataframe = pd.merge(df1, df2, how = 'inner', on = 'eid')

dataframe

   eid    ename  stipend      designation
0   11      Bob    10000         Employee
1   12    Alice    10000         Employee
2   13   Robert     5000           Intern
3   14    Henry    15000  Senior Employee
4   15   Graham     5000           Intern
5   16  Patrick    10000         Employee
6   17     Paul    10000         Employee